#pragma once
#include <pebble.h>
// Accuracy modes
#define ACCURACY_QUARTER    0
#define ACCURACY_HALF       1
#define ACCURACY_HOUR       2
#define ACCURACY_HALF_DAY   3
#define ACCURACY_DAY_NIGHT  4
#define ACCURACY_PERIOD     5

static const char* const FARSI_HEADER = "ﺎﺒﯾﺮﻘﺗ ﻥﺎﻟﺍ";
static const char* const FARSI_QUARTER[12][4] = {
  { "ﺖﻋﺎﺳ\nﺍ ﻩﺩﺯﺍﻭﺩ", "ﺖﻋﺎﺳ\nﻩﺩﺯﺍﻭﺩ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﻩﺩﺯﺍﻭﺩ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﮏﯾ" },
  { "ﺖﻋﺎﺳ\nﺍ ﮏﯾ", "ﺖﻋﺎﺳ\nﮏﯾ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﮏﯾ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﻭﺩ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻭﺩ", "ﺖﻋﺎﺳ\nﻭﺩ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﻭﺩ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﻪﺳ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻪﺳ", "ﺖﻋﺎﺳ\nﻪﺳ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﻪﺳ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﺭﺎﻬﭼ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺭﺎﻬﭼ", "ﺖﻋﺎﺳ\nﺭﺎﻬﭼ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﺭﺎﻬﭼ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﺞﻨﭘ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺞﻨﭘ", "ﺖﻋﺎﺳ\nﺞﻨﭘ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﺞﻨﭘ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﺶﺷ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺶﺷ", "ﺖﻋﺎﺳ\nﺶﺷ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﺶﺷ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﺖﻔﻫ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺖﻔﻫ", "ﺖﻋﺎﺳ\nﺖﻔﻫ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﺖﻔﻫ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﺖﺸﻫ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺖﺸﻫ", "ﺖﻋﺎﺳ\nﺖﺸﻫ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﺖﺸﻫ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﻪﻧ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻪﻧ", "ﺖﻋﺎﺳ\nﻪﻧ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﻪﻧ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﻩﺩ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻩﺩ", "ﺖﻋﺎﺳ\nﻩﺩ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﻩﺩ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﻩﺩﺯﺎﯾ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻩﺩﺯﺎﯾ", "ﺖﻋﺎﺳ\nﻩﺩﺯﺎﯾ\nﺍ ﻊﺑﺭ ﻭ", "ﺖﻋﺎﺳ\nﻩﺩﺯﺎﯾ\nﺍ ﻢﯿﻧ ﻭ", "ﻊﺑﺭ ﻪﯾ\nﻪﺑ ﻩﺪﻧﻮﻣ\nﻩﺩﺯﺍﻭﺩ" },
};
static const char* const FARSI_HALF[12][2] = {
  { "ﺖﻋﺎﺳ\nﺍ ﻩﺩﺯﺍﻭﺩ", "ﺖﻋﺎﺳ\nﻩﺩﺯﺍﻭﺩ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﮏﯾ", "ﺖﻋﺎﺳ\nﮏﯾ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻭﺩ", "ﺖﻋﺎﺳ\nﻭﺩ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻪﺳ", "ﺖﻋﺎﺳ\nﻪﺳ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺭﺎﻬﭼ", "ﺖﻋﺎﺳ\nﺭﺎﻬﭼ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺞﻨﭘ", "ﺖﻋﺎﺳ\nﺞﻨﭘ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺶﺷ", "ﺖﻋﺎﺳ\nﺶﺷ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺖﻔﻫ", "ﺖﻋﺎﺳ\nﺖﻔﻫ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﺖﺸﻫ", "ﺖﻋﺎﺳ\nﺖﺸﻫ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻪﻧ", "ﺖﻋﺎﺳ\nﻪﻧ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻩﺩ", "ﺖﻋﺎﺳ\nﻩﺩ\nﺍ ﻢﯿﻧ ﻭ" },
  { "ﺖﻋﺎﺳ\nﺍ ﻩﺩﺯﺎﯾ", "ﺖﻋﺎﺳ\nﻩﺩﺯﺎﯾ\nﺍ ﻢﯿﻧ ﻭ" },
};
static const char* const FARSI_HOUR[12] = {
  "ﺖﻋﺎﺳ\nﺍ ﻩﺩﺯﺍﻭﺩ",
  "ﺖﻋﺎﺳ\nﺍ ﮏﯾ",
  "ﺖﻋﺎﺳ\nﺍ ﻭﺩ",
  "ﺖﻋﺎﺳ\nﺍ ﻪﺳ",
  "ﺖﻋﺎﺳ\nﺍ ﺭﺎﻬﭼ",
  "ﺖﻋﺎﺳ\nﺍ ﺞﻨﭘ",
  "ﺖﻋﺎﺳ\nﺍ ﺶﺷ",
  "ﺖﻋﺎﺳ\nﺍ ﺖﻔﻫ",
  "ﺖﻋﺎﺳ\nﺍ ﺖﺸﻫ",
  "ﺖﻋﺎﺳ\nﺍ ﻪﻧ",
  "ﺖﻋﺎﺳ\nﺍ ﻩﺩ",
  "ﺖﻋﺎﺳ\nﺍ ﻩﺩﺯﺎﯾ",
};
static const char* const FARSI_HALF_DAY[2] = { "ﻪﺤﺒﺻ", "ﻪﺒﺷ" };
static const char* const FARSI_DAY_NIGHT[2] = { "ﻩﺯﻭﺭ", "ﻪﺒﺷ" };
static const char* const FARSI_PERIOD[5] = { "ﻪﺤﺒﺻ", "ﻩﺮﻬﻇ", "ﻩﺮﻬﻇﺯﺍﺪﻌﺑ", "ﻩﺮﺼﻋ", "ﻪﺒﺷ" };